; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 972291 2 2 3 8 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	thermograph2 - mode
	image0 - mode
	thermograph1 - mode
	Star2 - direction
	Star5 - direction
	GroundStation7 - direction
	GroundStation0 - direction
	Star6 - direction
	Star3 - direction
	Star4 - direction
	GroundStation1 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 image0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star3)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(pointing satellite1 GroundStation1)
	(have_image Star8 thermograph1)
	(have_image Planet9 image0)
	(have_image Planet10 thermograph1)
	(have_image Planet11 thermograph2)
	(have_image Star12 thermograph2)
))

)

; plan
1. (turn_to satellite1 groundstation1 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 7
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 7
3. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 7
4. (calibrate satellite0 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 1 of 7
5. (turn_to satellite1 star3 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star3)
   goals met: 0 of 7
6. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 0 of 7
7. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 7
8. (take_image satellite0 star8 instrument1 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 1 of 7
9. (turn_to satellite1 star12 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star12)
   goals met: 1 of 7
10. (turn_to satellite0 planet9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet9)
   goals met: 1 of 7
11. (take_image satellite1 star12 instrument2 thermograph2)
   added: (have_image star12 thermograph2)
   goals met: 2 of 7
12. (turn_to satellite1 planet11 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 planet11)
   goals met: 2 of 7
13. (take_image satellite0 planet9 instrument1 image0)
   added: (have_image planet9 image0)
   goals met: 3 of 7
14. (turn_to satellite0 planet10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet10)
   goals met: 3 of 7
15. (take_image satellite1 planet11 instrument2 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 4 of 7
16. (turn_to satellite1 groundstation1 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 groundstation1)
   goals met: 5 of 7
17. (take_image satellite0 planet10 instrument1 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 6 of 7
18. (turn_to satellite0 groundstation1 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 groundstation1)
   goals met: 7 of 7
